Revit 2015 API
StructuralSectionRectangular Class
 Defines common set of parameters for structural section rectangular contour.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public class StructuralSectionRectangular : StructuralSection
Visual Basic
Public Class StructuralSectionRectangular _
	Inherits StructuralSection
Visual C++
public ref class StructuralSectionRectangular : public StructuralSection
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleParameterized
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangularBar
See Also
StructuralSectionRectangular Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace